# Incorrect Format & Data Type

In [4]:
import pandas as pd
import numpy as np

In [11]:
# Create the DataFrame with incorrect formats and data types
data = {
    'age': ['25', '20', '30', '35', '18', '30', '30'],
    'gender': ['M', 'F', 'M', 'M', 'F', 'F', 'M'],
}
df = pd.DataFrame(data)
df

  age gender
0  25      M
1  20      F
2  30      M
3  35      M
4  18      F
5  30      F
6  30      M

# Format Correction

## Numeric column with string data type

In [14]:
# Format Correction
df['age'] = df['age'].astype(int)  # Convert 'age' column to integer data type
df

   age  gender
0   25    Male
1   20  Female
2   30    Male
3   35    Male
4   18  Female
5   30  Female
6   30    Male

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     7 non-null      int32
 1   gender  7 non-null      object
dtypes: int32(1), object(1)
memory usage: 216.0+ bytes

## Data type Conversion

In [13]:
# Data Type Conversion
df['gender'] = df['gender'].replace({'M': 'Male', 'F': 'Female'})  # Convert 'gender' values to full words
df

  age  gender
0  25    Male
1  20  Female
2  30    Male
3  35    Male
4  18  Female
5  30  Female
6  30    Male

## Extra Whitespace

In [31]:
df1 = pd.DataFrame({'product_name':['   BREAD  ','Ice Coffee   ','    Ice Tea']})
print(df1)

    product_name
0        BREAD
1  Ice Coffee
2        Ice Tea

In [32]:
# Remove extra whitespace from the 'product_name' column
df1['product_name'] = df1['product_name'].str.strip()

# Display the cleaned DataFrame
print(df1)

  product_name
0        BREAD
1   Ice Coffee
2      Ice Tea

In this code snippet, we use the str.replace() function to replace all occurrences of a space ' ' with an empty string ''. This effectively removes all the spaces from the 'product_name' column.

In [38]:
# Remove extra whitespace from the 'product_name' column using str.replace()
df1['product_name'] = df1['product_name'].str.replace(' ', '')

# Display the cleaned DataFrame
print(df1)

  product_name
0        BREAD
1    ICECOFFEE
2       ICETEA

## Inconsistent capitalization of text

In [33]:
df1

  product_name
0        BREAD
1   Ice Coffee
2      Ice Tea

In [36]:
#Uppercase
df1['product_name'] = df1['product_name'].str.upper()
print('\n')
print(df1)

  product_name
0        BREAD
1   ICE COFFEE
2      ICE TEA

In [35]:
#Lowercase
print(df1)
df1['product_name'] = df1['product_name'].str.lower()
print('\n')
print(df1)

  product_name
0        BREAD
1   Ice Coffee
2      Ice Tea


  product_name
0        bread
1   ice coffee
2      ice tea